/** \file
 * \brief Example code for Simple Open EtherCAT master
 *
 * Usage : simple_test [ifname1]
 * ifname is NIC interface, f.e. eth0
 *
 * This is a minimal test.
 *
 * (c)Arthur Boxi 2024 - 2025
 * (c)Arthur Ketels 2010 - 2011
 */

#ifndef _ETHERCAT_MOTOR_H
#define _ETHERCAT_MOTOR_H

#include <stdio.h>
#include <string.h>
#include <sys/time.h>
#include <unistd.h>
#include <math.h>
#include <stdlib.h>
#include <vector>

#include <pthread.h>
#include <thread> // TODO

// #include <pybind11/pybind11.h>
// #include <pybind11/numpy.h> // For passing NumPy arrays

#include <iostream>
#include <sstream>

#include "ethercat.h"

#define EC_TIMEOUTMON 500

#define NUM_TARGET 6 // num of motors
// #define NUM_TARGET 1 // num of motors

constexpr double gear_ratio[] = {20, 20, 20, 20, 10, 10}; // 6
// double gear_ratio[] = {1,1,1,1,1,1}; // hack changeback
constexpr double torque_multiplier[] = {1, 1, 1, 1, 1, 1}; // 6
// constexpr double torque_multiplier[] = {0, 0, 0, 0, 0, 1}; // 6


char IOmap[4096];

int expectedWKC;                    // Expected Working Counter value (used for data exchange validation).
volatile int wkc;                   // Actual Working Counter value received
boolean needlf;                     // Flag to control newline printing.
boolean inOP;                       // Flag indicating if slaves are in operational state.
uint8 currentgroup = 0;             // Currently active EtherCAT group.
boolean forceByteAlignment = FALSE; // Flag to control byte alignment of IO memory.

enum CONTROL_MODE : int8
{
    CYCLIC_SYNC_POSITION = 8, // Cyclic sync position mode
    CYCLIC_SYNC_VELOCITY = 9, // Cyclic sync velocity mode
    CYCLIC_SYNC_TORQUE = 10   // Cyclic sync torque mode
};

// 0x1607 RPDO8
struct out_ELMOt             // pdo
{                            // 1c12
    int32 target_position;   // 0x607a
    int32 target_velocity;   // 0x60ff
    int32 velocity_offset;   // 0x60b1
    int16 max_torque;        // 0x6072
    int16 target_torque;     // 0x6071 -1000~1000, 0.1% of "Motor rated current (0x6075)"
    int16 torque_offset;     // 0x60b2 -1000~1000, 0.1% of "Motor rated current (0x6075)"
    uint16 control_word;     // 0x6040 pdo domain 0x1604
    uint8 mode_of_operation; // 0x6060
};
// 0x1A07; // "TPDO8 Mapping"
struct in_ELMOt                   // pdo
{                                 // 1c13
    int32 position_actual;        // 0x6064
    int32 position_follow_err;    // 0x60f4
    int32 velocity_actual;        // 0x606C
    int16 torque_actual;          // 0x6077
    uint16 status_word;           // 0x6041
    uint8 mode_of_operation_disp; // 0x6061
};

#define READ(slaveId, idx, sub, buf, comment)                                                                                                                        \
    {                                                                                                                                                                \
        buf = 0;                                                                                                                                                     \
        int __s = sizeof(buf);                                                                                                                                       \
        int __ret = ec_SDOread(slaveId, idx, sub, FALSE, &__s, &buf, EC_TIMEOUTRXM);                                                                                 \
