/** \file
 * \brief Example code for Simple Open EtherCAT master
 *
 * Usage : simple_test [ifname1]
 * ifname is NIC interface, f.e. eth0
 *
 * This is a minimal test.
 *
 * (c)Arthur Boxi 2024 - 2025
 * (c)Arthur Ketels 2010 - 2011
 */

#ifndef _ETHERCAT_MOTOR_H
#define _ETHERCAT_MOTOR_H

// #include <stdio.h>

// #include <sys/time.h>
// #include <unistd.h>
#include <math.h>
#include <atomic>
#include <pthread.h>
#include <thread> // TODO

// #include <pybind11/pybind11.h>
// #include <pybind11/numpy.h> // For passing NumPy arrays

#include <iostream>
#include <sstream>
#include <string>

#include <Eigen/Dense>
// #include <Eigen/Core>

#include "Iir.h"  // Include the iir1 library header

#include "ethercat.h"

template <typename ScalarType, int NumElements>
using VectorNd = Eigen::Matrix<ScalarType, NumElements, 1>;

#define EC_TIMEOUTMON 500

#define NUM_TARGET 10 // num of motors

// const VectorNd<double, 10> gear_ratio_all = {18, 20, 18, 18, 10, 18, 20, 18, 18, 10};
// const VectorNd<double, 10> torque_multiplier_all = {1, 1, 1, 1, 1, 1, 1, 1, 1, 1};

// 2020-20 motor current torue ratio: toruqe [NM] = 2.0 * current [A] (from measurement)
// 2010-10 motor current torque ratio: toruqe [NM] = 1.6325 * current [A] (from figure)

enum CONTROL_MODE : int8
{
    CYCLIC_SYNC_POSITION = 8, // Cyclic sync position mode
    CYCLIC_SYNC_VELOCITY = 9, // Cyclic sync velocity mode
    CYCLIC_SYNC_TORQUE = 10   // Cyclic sync torque mode
};

// 0x1607 RPDO8
struct tx_pdo_t              // tx pdo
{                            // 1c12
    int32 target_position;   // 0x607a
    int32 target_velocity;   // 0x60ff
    int32 velocity_offset;   // 0x60b1
    int16 max_torque;        // 0x6072
    int16 target_torque;     // 0x6071 -1000~1000, 0.1% of "Motor rated current (0x6075)"
    int16 torque_offset;     // 0x60b2 -1000~1000, 0.1% of "Motor rated current (0x6075)"
    uint16 control_word;     // 0x6040 pdo domain 0x1604
    uint8 mode_of_operation; // 0x6060
};
// 0x1A07; // "TPDO8 Mapping"
struct rx_pdo_t                   // rx pdo
{                                 // 1c13
    int32 position_actual;        // 0x6064
    int32 position_follow_err;    // 0x60f4
    int32 velocity_actual;        // 0x606C
    int16 torque_actual;          // 0x6077
    uint16 status_word;           // 0x6041
    uint8 mode_of_operation_disp; // 0x6061
};

template <typename T>
void print_eigen_vec(T vector, const char format[], const char pre[], const char after[] = "\n")
{
    printf("%s", pre);
    for (auto value : vector)
    {
        printf(format, value);
    }
    printf("%s", after);
}

template <typename T>
int READ(int slaveId, int idx, int sub, T &buf, const std::string &comment, bool verbose = true)
{ // blocking, takes about 2ms
    buf = 0;
    int __s = sizeof(buf);
    int wkc = ec_SDOread(slaveId, idx, sub, FALSE, &__s, &buf, EC_TIMEOUTRXM);
    if (verbose) {
    // printf("Slave: %d - Read at 0x%04x:%d => wkc: %d; data: 0x%.*x (%d)\t[%s]\n", slaveId, idx, sub, wkc, __s, (unsigned int)buf, (unsigned int)buf, comment.c_str());
    // ANSI Code based on wkc, print in red if wkc==0
    const char *colorCode = (wkc == 0) ? "\033[31;1m" : "";
    printf("%sSlave:%2d - READ  at 0x%04x:%d => wkc: %d; data: 0x%.*x (%d)\t[%s]\033[0m\n",
