/** \file
 * \brief Example code for Simple Open EtherCAT master
 *
 * Usage : simple_test [ifname1]
 * ifname is NIC interface, f.e. eth0
 *
 * This is a minimal test.
 *
 * (c)Arthur Ketels 2010 - 2011
 */

#include <stdio.h>
#include <string.h>
#include <sys/time.h>
#include <unistd.h>
#include <pthread.h>
#include <math.h>
#include <stdlib.h>

#include <iostream>
#include <sstream>

#include <ethercattype.h>
#include <nicdrv.h>
#include <ethercatbase.h>
#include <ethercatmain.h>
#include <ethercatdc.h>
#include <ethercatcoe.h>
#include <ethercatfoe.h>
#include <ethercatconfig.h>
#include <ethercatprint.h>


#define EC_TIMEOUTMON 500

#define NUM_TARGET 6 // num of motors

enum CONTROL_MODE : int8
{
   CYCLIC_SYNC_POSITION = 8, // Cyclic sync position mode
   CYCLIC_SYNC_VELOCITY = 9, // Cyclic sync velocity mode
   CYCLIC_SYNC_TORQUE = 10   // Cyclic sync torque mode
};

// double gear_ratio[NUM_TARGET] = {20,20,20,20,10,10};

char IOmap[4096];
OSAL_THREAD_HANDLE thread1;
OSAL_THREAD_HANDLE thread2;
int expectedWKC;
boolean needlf;
volatile int wkc;
boolean inOP;
uint8 currentgroup = 0;
boolean forceByteAlignment = FALSE;
boolean SendFlag = FALSE;

// 1604 RXDO
struct TorqueOut
{
   int32 target_position; // 607A
   int32 target_velocity; // 60FF
   uint16 maximal_torque; // 6072
   uint16 control_word;   // 6040
};

// 1a03 TPDO
struct TorqueIn
{
   int32 position_actual; // 6064
   uint32 digital_inputs; // 60FD
   int32 velocity_actual; // 606C
   uint16 status_word;    // 6041
};

struct out_ELMOt              // pdo
{                             // 1c12
   int32_t target_position;   // 0x607a
   int32_t target_velocity;   // 0x60ff
   int16_t max_torque;        // 0x6072
   uint16_t control_word;     // 0x6040 pdo domain 0x1604
   int16_t target_torque;     // 0x6071
   uint8_t mode_of_operation; // 0x6060
};

struct in_ELMOt                    // pdo
{                                  // 1c13
   int32_t position_actual;        // 0x6064
   int32_t position_follow_err;    // 0x60f4
   int16_t torque_actual;          // 0x6077
   uint16_t status_word;           // 0x6041
   uint8_t mode_of_operation_disp; // 0x6061
   int32_t velocity_actual;        // 0x606C
};

// struct TorqueOut *target[NUM_TARGET];
// struct TorqueIn *val[NUM_TARGET];

struct out_ELMOt *target[NUM_TARGET];
struct in_ELMOt *val[NUM_TARGET];

void *ecatprint()
{
   //  int slave;
   while (1)
   {
      //   printf("Main Outputs:  Target: 0x%x, control: 0x%x\n", target->target_position, target->control_word);
      //   printf("Main Inputs:  Target: 0x%x, control: 0x%x\n", val->position_actual, val->status_word);
      // printf("Flag: %d\n", SendFlag);
      SendFlag = !SendFlag;
      // printf("Flag: %d\n", SendFlag);
      ec_send_processdata();
      wkc = ec_receive_processdata(EC_TIMEOUTRET);
      usleep(1000);
   }
}

#define READ(slaveId, idx, sub, buf, comment)                                                                                                                      \
